backend/modules/user/controllers/ActionController.php

DELETE FROM `tbl_user` WHERE username = 'eee'
---
    public function actionDeletedata($username){

      $delete=User::deleteAll('username = :username', [':username' => $username]);

INSERT INTO `tbl_user` (`data_id`, `username`, `password2`, `password`, `level_id`, `nama`) VALUES ('eee', 'eee', 'eee', '$2y$13$W1n58l848gOy8w8/CodxDuhAqAJetEHjrvbsD7p1sGVOCQjCoEiV.', 1, 'eee')
---
    public function actionAdd_data(){
  $request = Yii::$app->request;
$user=new User;
$user->data_id=$_REQUEST['data_id'];
$user->username=$_REQUEST['username'];
$user->password2=$_REQUEST['password'];
$user->password=Yii::$app->getSecurity()->generatePasswordHash($_REQUEST['password']);
$user->level_id=$_REQUEST['level'];
$user->nama=$_REQUEST['nama'];
$save=$user->save();