backend/modules/user/controllers/DefaultController.php

SELECT * FROM `tbl_user_level`
SELECT * FROM `tbl_branch`
SELECT * FROM `tbl_customers`
---
    public function actionIndex()
    {
      $session=Yii::$app->session;
      if (!$session['username']) {
        return Yii::$app->getResponse()->redirect(Url::toRoute('/login'));
      }
      $level=UserLevel::find()->all();
      $branch=Branch::find()->all();
      $customers=Customers::find()->all();