frontend/modules/monitoring/fuel/controllers/ActionController.php

SELECT * FROM `tbl_transaction` WHERE `LAB_NO`='09003395'
---
    public function actionReport($type,$labNumber){

      $data=TbTransaction::find()
      ->where(['LAB_NO'=>$labNumber])
      ->one();

SELECT * FROM `tbl_fuel` WHERE `report_id`='12JHED8AYC8K'
---
    public function actionView($reportid){
      $data=Fuel::find()
      ->where(['report_id'=>$reportid])->one();