frontend/modules/monitoring/fuel/controllers/DefaultController.php

    public function actionIndex()
    {
    	       $tbTransaction=TbTransaction::find()
->limit(12)
       ->all();
---
SELECT * FROM `tbl_transaction` LIMIT 12