backend/modules/monitoring/fuel/controllers/ApiController.php

INSERT INTO `tbl_fuel` (`report_id`, `report_date`, `receive_date`, `sample_date`, `group`, `customer_id`, `departement_id`, `lab_number`, `Job_number`, `detail_of_sample`, `target_lead_time`, `actual_lead_time`, `Alert`, `file_upload`) VALUES ('12JHED8AYC8K', '2017-05-10', '2017-05-12', '2017-05-12', 'fmc', '15', 'lb', '12323432', '333', 'test', 4, 4, 4, 'rpt_fuel_id_12JHED8AYC8K_1BI1D7IQ_Z2BT_00GH.pdf')
---
$fuel->actual_lead_time=$actual_lead_time;
$fuel->Alert=$alert;
$fuel->file_upload=$pdfname;
$savedata=$fuel->save();