backend/modules/monitoring/fuel/controllers/DefaultController.php

SELECT * FROM `tbl_customers`
SELECT * FROM `tbl_departement`
---
    public function actionIndex()
    {
    	       $customers=Customers::find()->all();
               $departement=Departement::find()->all();