backend/models/AuthForm.php

SELECT * FROM `tbl_user_level` WHERE `level_id`=1
---
public static function validateUser($username,$password){
$session=Yii::$app->session;
$check=User2::find()
    ->where(['username' => $username,'level_id'=>1])
    ->one();

    if (!$check) {
    	 return Yii::$app->getResponse()->redirect('/login');
    }elseif($check){
    	$hash=$check->password;
$pass=Yii::$app->getSecurity()->validatePassword($password,$hash);
if ($pass) {
	$userlevel=UserLevel::find()
    ->where(['level_id' => $check->level_id])
    ->one();