frontend/modules/api/controllers/UsedoilController.php

	public function actionGetdata($token){
		\Yii::$app->response->format=\Yii\web\Response::FORMAT_JSON;

		$session = Yii::$app->session;
		$tokencek=Api::find()
		->select(['token'])
      ->where(['token'=>$token])
      ->one();
---
SELECT `token` FROM `api` WHERE `token`='itpetrolab'